<a href="https://colab.research.google.com/github/cs16677/ce888/blob/master/lab4/bank_classification.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [77]:
import pandas as pd
import numpy as np
from sklearn import preprocessing
from sklearn.ensemble import ExtraTreesClassifier
from sklearn.model_selection import KFold

data = pd.read_csv("bank-additional-full.csv", delimiter=';')
data.head()

   age        job  marital  ... euribor3m nr.employed   y
0   56  housemaid  married  ...     4.857      5191.0  no
1   57   services  married  ...     4.857      5191.0  no
2   37   services  married  ...     4.857      5191.0  no
3   40     admin.  married  ...     4.857      5191.0  no
4   56   services  married  ...     4.857      5191.0  no

[5 rows x 21 columns]

In [76]:
def rem_unknown(data, col):
  return data[~data[col].isin(["unknown"])]

def rem_unknowns(data, cols):
  for col in cols:
    data = rem_unknown(data, col)
  return data

def apply_encoder(data, cols):
  encoder = LabelEncoder()
  for col in cols: 
    data[[col]] = data[[col]].apply(encoder.fit_transform)
  return data

# remove rows with "unknown" columns
columns = np.array(["job", "marital", "education", "default", "housing", "loan"])
filt_data = rem_unknowns(data, columns)
# delete duration
del filt_data["duration"]

# remove y_no
filt_data = pd.get_dummies(filt_data, columns=["y"])
del filt_data["y_no"] 

# use label encoding on all string columns
columns = np.append(columns, ["contact", "month", "day_of_week", "poutcome"])
filt_data = apply_encoder(filt_data, columns)

print(data.size)
print(filt_data.size)
filt_data[160:170]

864948
609760

     age  job  marital  education  ...  cons.conf.idx  euribor3m  nr.employed  y_yes
284   42    1        0          2  ...          -36.4      4.857       5191.0      0
285   44    1        0          1  ...          -36.4      4.857       5191.0      0
286   39    3        1          2  ...          -36.4      4.857       5191.0      1
287   37    0        2          3  ...          -36.4      4.857       5191.0      0
289   36    7        1          3  ...          -36.4      4.857       5191.0      0
290   42    4        0          6  ...          -36.4      4.857       5191.0      0
291   31    0        1          3  ...          -36.4      4.857       5191.0      0
293   45    1        1          0  ...          -36.4      4.857       5191.0      0
294   37    9        2          5  ...          -36.4      4.857       5191.0      0
295   47    6        1          5  ...          -36.4      4.857       5191.0      0

[10 rows x 20 columns]

In [0]:
classifier = ExtraTreesClassifier(n_estimators=100)
fold = KFold(n_splits=10)